doc/s-sql-u.org
#+TITLE: S-SQL Examples U
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* Union, Union-all
  :PROPERTIES:
  :CUSTOM_ID: union
  :END:
As you probably know, the union operation generally eliminates what it thinks are duplicate rows. The union-all operation preserves duplicate rows. The examples below use the union-all operator, but the syntax would be the same with union.
#+begin_src lisp
  (query (:select 'id 'name
                  :from (:as (:union-all
                              (:select 'id 'name
                                       :from 'countries
                                       :where (:<= 'name "B" ))
                              (:select 'id 'name
                                       :from 'countries
                                       :where (:>= 'name "V" )))
                             'a)))

  ((140 "Algeria") (83 "American Samoa") (202 "Angola") (45 "Argentina")(195 "Aruba") (38 "Australia") (1 "Austria") (117 "Azerbaijan") (121 "Antigua") (34 "All") (130 "Albania") (127 "Armenia") (82 "Afghanistan") (142 "Zimbabwe") (43 "Worldwide") (66 "Venezuela") (111 "Vanuatu") (115 "Wallis") (141 "Zambia") (68 "Vietnam") (212 "Yemen")(215 "test6"))

  (query (:select 'a.id 'a.name 'a.region
          :from (:as (:union-all
                      (:select 'countries.id 'countries.name
                               (:as 'regions.name 'region)
                       :from 'countries 'regions
                               :where (:and
                                       (:<= 'countries.name "B")
                                       (:= 'regions.id 'countries.region-id)))
                      (:select 'countries.id 'countries.name
                               (:as 'regions.name 'region)
                       :from 'countries 'regions
                               :where (:and
                                       (:>= 'countries.name "V")
                                       (:= 'regions.id 'countries.region-id ))))
                     'a)
          :group-by 'a.id 'a.region 'a.name))

  ((140 "Algeria" "Africa") (1 "Austria" "Western Europe")   (68 "Vietnam"  "Asia") (83 "American Samoa" "Pacific")   (202 "Angola""Africa") (121  "Antigua" "Caribbean")  (127 "Armenia" "Eastern  Europe") (66 "Venezuela""South America")   (45  "Argentina" "South  America") (195 "Aruba""Caribbean")   (38  "Australia" "Pacific")(82 "Afghanistan" "Asia")   (130 "Albania" "Eastern Europe") (111 "Vanuatu" "Pacific")  (212 "Yemen" "Middle East") (115 "Wallis"  "Pacific")   (142 "Zimbabwe" "Africa")  (117 "Azerbaijan" "Easter Europe")   (141 "Zambia" "Africa"))

#+end_src

* Unique
  :PROPERTIES:
  :CUSTOM_ID: unique
  :END:
Unique is a constraint used in creating tables. Note the use in the following query used to build the regions table.
#+begin_src lisp
  (query (:create-table regions
                        ((id :type int4 :primary-key t)
                         (name :type varchar :default "" :unique t))))
#+end_src


