doc/s-sql-u.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 19:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples U</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples U</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf500c2c">S-SQL Examples Home Page</a></li>
<li><a href="#union">Union, Union-all</a></li>
<li><a href="#unique">Unique</a></li>
<li><a href="#update">Update</a>
<ul>
<li><a href="#alternative-column-list">Alternative Column list Syntax</a></li>
<li><a href="#single-value">Single New Value for Multiple Rows</a></li>
<li><a href="#using-case">Using a Case Statement</a></li>
<li><a href="#from-another-table">Pulling Updated Info From Another Table</a></li>
</ul>
</li>
<li><a href="#upsert">Upsert or "On Conflict"</a></li>
<li><a href="#using">Using</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgf500c2c" class="outline-2">
<h2 id="orgf500c2c"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orgf500c2c">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-union" class="outline-2">
<h2 id="union">Union, Union-all</h2>
<div class="outline-text-2" id="text-union">
<p>
As you probably know, the union operation generally eliminates what it thinks are duplicate rows. The union-all operation preserves duplicate rows. The examples below use the union-all operator, but the syntax would be the same with union.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:union-all</span>
                            (<span class="org-builtin">:select</span> 'id 'name
                                     <span class="org-builtin">:from</span> 'countries
                                     <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;=</span> 'name <span class="org-string">"B"</span> ))
                            (<span class="org-builtin">:select</span> 'id 'name
                                     <span class="org-builtin">:from</span> 'countries
                                     <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;=</span> 'name <span class="org-string">"V"</span> )))
                           'a)))

((140 <span class="org-string">"Algeria"</span>) (83 <span class="org-string">"American Samoa"</span>) (202 <span class="org-string">"Angola"</span>) (45 <span class="org-string">"Argentina"</span>)(195 <span class="org-string">"Aruba"</span>) (38 <span class="org-string">"Australia"</span>) (1 <span class="org-string">"Austria"</span>) (117 <span class="org-string">"Azerbaijan"</span>) (121 <span class="org-string">"Antigua"</span>) (34 <span class="org-string">"All"</span>) (130 <span class="org-string">"Albania"</span>) (127 <span class="org-string">"Armenia"</span>) (82 <span class="org-string">"Afghanistan"</span>) (142 <span class="org-string">"Zimbabwe"</span>) (43 <span class="org-string">"Worldwide"</span>) (66 <span class="org-string">"Venezuela"</span>) (111 <span class="org-string">"Vanuatu"</span>) (115 <span class="org-string">"Wallis"</span>) (141 <span class="org-string">"Zambia"</span>) (68 <span class="org-string">"Vietnam"</span>) (212 <span class="org-string">"Yemen"</span>)(215 <span class="org-string">"test6"</span>))

(query (<span class="org-builtin">:select</span> 'a.id 'a.name 'a.region
        <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:union-all</span>
                    (<span class="org-builtin">:select</span> 'countries.id 'countries.name
                             (<span class="org-builtin">:as</span> 'regions.name 'region)
                     <span class="org-builtin">:from</span> 'countries 'regions
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span>
                                     (<span class="org-builtin">:&lt;=</span> 'countries.name <span class="org-string">"B"</span>)
                                     (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id)))
                    (<span class="org-builtin">:select</span> 'countries.id 'countries.name
                             (<span class="org-builtin">:as</span> 'regions.name 'region)
                     <span class="org-builtin">:from</span> 'countries 'regions
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span>
                                     (<span class="org-builtin">:&gt;=</span> 'countries.name <span class="org-string">"V"</span>)
                                     (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id ))))
                   'a)
        <span class="org-builtin">:group-by</span> 'a.id 'a.region 'a.name))

((140 <span class="org-string">"Algeria"</span> <span class="org-string">"Africa"</span>) (1 <span class="org-string">"Austria"</span> <span class="org-string">"Western Europe"</span>)   (68 <span class="org-string">"Vietnam"</span>  <span class="org-string">"Asia"</span>) (83 <span class="org-string">"American Samoa"</span> <span class="org-string">"Pacific"</span>)   (202 <span class="org-string">"Angola""Africa"</span>) (121  <span class="org-string">"Antigua"</span> <span class="org-string">"Caribbean"</span>)  (127 <span class="org-string">"Armenia"</span> <span class="org-string">"Eastern  Europe"</span>) (66 <span class="org-string">"Venezuela""South America"</span>)   (45  <span class="org-string">"Argentina"</span> <span class="org-string">"South  America"</span>) (195 <span class="org-string">"Aruba""Caribbean"</span>)   (38  <span class="org-string">"Australia"</span> <span class="org-string">"Pacific"</span>)(82 <span class="org-string">"Afghanistan"</span> <span class="org-string">"Asia"</span>)   (130 <span class="org-string">"Albania"</span> <span class="org-string">"Eastern Europe"</span>) (111 <span class="org-string">"Vanuatu"</span> <span class="org-string">"Pacific"</span>)  (212 <span class="org-string">"Yemen"</span> <span class="org-string">"Middle East"</span>) (115 <span class="org-string">"Wallis"</span>  <span class="org-string">"Pacific"</span>)   (142 <span class="org-string">"Zimbabwe"</span> <span class="org-string">"Africa"</span>)  (117 <span class="org-string">"Azerbaijan"</span> <span class="org-string">"Easter Europe"</span>)   (141 <span class="org-string">"Zambia"</span> <span class="org-string">"Africa"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-unique" class="outline-2">
<h2 id="unique">Unique</h2>
<div class="outline-text-2" id="text-unique">
<p>
Unique is a constraint used in creating tables. Note the use in the following query used to build the regions table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> regions
                      ((id <span class="org-builtin">:type</span> int4 <span class="org-builtin">:primary-key</span> t)
                       (name <span class="org-builtin">:type</span> varchar <span class="org-builtin">:default</span> <span class="org-string">""</span> <span class="org-builtin">:unique</span> t))))
</pre>
</div>
</div>
</div>
