doc/s-sql-u.html


<div id="outline-container-update" class="outline-2">
<h2 id="update">Update</h2>
<div class="outline-text-2" id="text-update">
<p>
In s-sql, updates operate the way you would expect them to, given what we have seen up above.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:update</span> 'countries <span class="org-builtin">:set</span> 'text '$1 <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 284)) <span class="org-string">"now"</span>)
</pre>
</div>

<p>
Now temporarily assume that we do not have a normalized database and we have a field "region_name" in the countries table in the database and a slot accessor named region-name in the countries class.
</p>

<p>
We could update a set of the countries rows to get the regional names for a particular set of countries, given a list of countries.id as follows:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span class="org-builtin">:update</span> 'countries
  <span class="org-builtin">:set</span> 'region-name
          (<span class="org-builtin">:select</span> 'name <span class="org-builtin">:from</span> 'regions
           <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'countries.id 'country-id))
          <span class="org-builtin">:where</span> (<span class="org-builtin">:in</span> 'countries.id
                      (<span class="org-builtin">:set</span> 129 139 132 128 135 134 131 137 130 133 136))))

</pre>
</div>

<p>
Assume you wanted to update a record with id=5 and you had a plist of the the columns to be updated.
</p>

<p>
Assuming you wanted to create something reusable, you could use a query like the following:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (sql-compile (append (append `(<span class="org-builtin">:update</span> ,table <span class="org-builtin">:set</span>)
                              plst)
                      `(<span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id ,id)))))
</pre>
</div>

<p>
You can use the RETURNING keyword to return all or parts of the updated entries.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (sql (<span class="org-builtin">:update</span> 'weather
             <span class="org-builtin">:set</span> 'temp-lo (<span class="org-builtin">:+</span> 'temp-lo 1) 'temp-hi (<span class="org-builtin">:+</span> 'temp-lo 15) 'prcp <span class="org-builtin">:default</span>
                     <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'city <span class="org-string">"San Francisco"</span>)
                                  (<span class="org-builtin">:=</span> 'date <span class="org-string">"2003-07-03"</span>))
                     <span class="org-builtin">:returning</span> 'temp-lo 'temp-hi 'prcp))
</pre>
</div>
</div>

<div id="outline-container-alternative-column-list" class="outline-3">
<h3 id="alternative-column-list">Alternative Column list Syntax</h3>
<div class="outline-text-3" id="text-alternative-column-list">
<p>
Use the alternative column-list syntax to do the same update:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:update</span> 'weather
        <span class="org-builtin">:columns</span> 'temp-lo 'temp-hi 'prcp
                (<span class="org-builtin">:set</span> (<span class="org-builtin">:+</span> 'temp-lo 1)  (<span class="org-builtin">:+</span> 'temp-lo 15)  <span class="org-builtin">:DEFAULT</span>)
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'city <span class="org-string">"San Francisco"</span>)
                             (<span class="org-builtin">:=</span> 'date <span class="org-string">"2003-07-03"</span>))))
</pre>
</div>
</div>
</div>


<div id="outline-container-single-value" class="outline-3">
<h3 id="single-value">Single New Value for Multiple Rows</h3>
<div class="outline-text-3" id="text-single-value">
<p>
When you need to update lots of rows, a single call to the database is often more efficient, but what that call looks like will depend on your data. If you have a single value that needs to be inserted into multiple rows, you just need to manage the condition clause. To create a silly example, suppose we want to change the intermediate_region_name in the regions table to "Too Close to the UK" instead of "Channel Islands". Here are three different ways to do that
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:update</span> 'regions
        <span class="org-builtin">:set</span> 'intermediate-region-name <span class="org-string">"Too Close to the UK"</span>
        <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'intermediate-region-name <span class="org-string">"Channel Islands"</span>)))

(query (<span class="org-builtin">:update</span> 'regions
        <span class="org-builtin">:set</span> 'intermediate-region-name <span class="org-string">"Too Close to the UK"</span>
        <span class="org-builtin">:where</span> (<span class="org-builtin">:in</span> 'id (<span class="org-builtin">:set</span> 179 180))))

(query (<span class="org-builtin">:update</span> 'regions
        <span class="org-builtin">:set</span> 'intermediate-region-name <span class="org-string">"Too Close to the UK"</span>
        <span class="org-builtin">:where</span> (<span class="org-builtin">:or</span> (<span class="org-builtin">:=</span> 'country <span class="org-string">"Guernsey"</span>)
                    (<span class="org-builtin">:=</span> 'country <span class="org-string">"Jersey"</span>))))

</pre>
</div>
</div>
</div>

<div id="outline-container-using-case" class="outline-3">
<h3 id="using-case">Using a Case Statement</h3>
<div class="outline-text-3" id="text-using-case">
<p>
If you have a limited number of situations with a different value for each situation, you can reach for a case statement.
</p>

<p>
Staying with silly renames of intermediate_region_names, suppose we want "Caribbean" to be "Warm Island Americas" (thus excluding Bermuda) and "Central America" to be "Connecting Bridge Americas". One form of the case statement accomplishing this could look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:update</span> 'regions
        <span class="org-builtin">:set</span> 'intermediate-region-name
              (<span class="org-builtin">:case</span> ((<span class="org-builtin">:=</span> 'intermediate-region-name <span class="org-string">"Caribbean"</span>)
                       <span class="org-string">"Warm Island Americas"</span>)
                     ((<span class="org-builtin">:=</span> 'intermediate-region-name <span class="org-string">"Central America"</span>)
                       <span class="org-string">"Connecting Bridge Americas"</span>))
         <span class="org-builtin">:where</span> (<span class="org-builtin">:in</span> 'intermediate-region-name
                   (<span class="org-builtin">:set</span> <span class="org-string">"Caribbean"</span> <span class="org-string">"Central America"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-from-another-table" class="outline-3">
<h3 id="from-another-table">Pulling Updated Info From Another Table</h3>
<div class="outline-text-3" id="text-from-another-table">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:update</span> 'geo
        <span class="org-builtin">:set</span> 'iso3 'regions.iso3
        <span class="org-builtin">:from</span> 'regions
        <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'regions.iso2 'geo.iso3)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-upsert" class="outline-2">
<h2 id="upsert">Upsert or "On Conflict"</h2>
<div class="outline-text-2" id="text-upsert">
<p>
Some people use the term "upsert" for trying to insert a new row, but if that record already exists, then either update the row with new values or do nothing (as opposed to throwing an error).
</p>

<p>
Beginning in Postgresql versions 9.5 and above, it is possible to use what Postgresql calls on-conflict. There are two versions - "on conflict do nothing" or "on conflict update". See below for sample call in postmodern for on-conflict-update.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test-table <span class="org-builtin">:set</span> 'column-A '$1 'column-B '$2
                     <span class="org-builtin">:on-conflict-update</span> 'column-A
                     <span class="org-builtin">:update-set</span> 'column-B '$2
                     <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'test-table.column-A '$1)) <span class="org-string"><span class="org-warning">"c"</span></span><span class="org-warning"> 37)</span>
</pre>
</div>

<p>
Or
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'countries.name <span class="org-builtin">:from</span> 'countries 'regions
                               <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:or</span> (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"North America"</span>)
                                            (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"Central America"</span>))
                                             (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id))))

</pre>
</div>
</div>
</div>
