doc/s-sql-u.org
* Using
  :PROPERTIES:
  :CUSTOM_ID: using
  :END:
From the postgresql docs: "USING is a shorthand notation: it takes a comma-separated list of column names, which the joined tables must have in common, and forms a join condition specifying equality of each of these pairs of columns. Furthermore, the output of JOIN USING has one column for each of the equated pairs of input columns, followed by the remaining columns from each table. Thus, USING (a, b, c) is equivalent to ON (t1.a = t2.a AND t1.b = t2.b AND t1.c = t2.c) with the exception that if ON is used there will be two columns a, b, and c in the result, whereas with USING there will be only one of each (and they will appear first if SELECT * is used).

Example: Sorry, real toy example here. We assume an additional table named "countries-topics" and that both countries-topics and countries have columns named country-id. We are looking for records from the countries table which do not have a match in the countries-topics table. In other words, where do we have a note, but not matched it to a topic? The difference between ":using" and ":on" is the requirement that both tables have columns with the same names. You could join using multiple columns, just adding them into the parenthetical following the keyword :using.
#+begin_src lisp
(defun countries-with-no-topics ()
  (query (:order-by
          (:select 'countries.id 'countries.name
                   :distinct
                   :from 'countries
                   :left-join 'countries-topics
                   :using ('country-id)
                   :where (:is-null 'countries-topics.country-id))
          'countries.country-id)))
#+end_src
