doc/s-sql-u.html

<div id="outline-container-using" class="outline-2">
<h2 id="using">Using</h2>
<div class="outline-text-2" id="text-using">
<p>
From the postgresql docs: "USING is a shorthand notation: it takes a comma-separated list of column names, which the joined tables must have in common, and forms a join condition specifying equality of each of these pairs of columns. Furthermore, the output of JOIN USING has one column for each of the equated pairs of input columns, followed by the remaining columns from each table. Thus, USING (a, b, c) is equivalent to ON (t1.a = t2.a AND t1.b = t2.b AND t1.c = t2.c) with the exception that if ON is used there will be two columns a, b, and c in the result, whereas with USING there will be only one of each (and they will appear first if SELECT * is used).
</p>

<p>
Example: Sorry, real toy example here. We assume an additional table named "countries-topics" and that both countries-topics and countries have columns named country-id. We are looking for records from the countries table which do not have a match in the countries-topics table. In other words, where do we have a note, but not matched it to a topic? The difference between ":using" and ":on" is the requirement that both tables have columns with the same names. You could join using multiple columns, just adding them into the parenthetical following the keyword :using.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">countries-with-no-topics</span> ()
  (query (<span class="org-builtin">:order-by</span>
          (<span class="org-builtin">:select</span> 'countries.id 'countries.name
                   <span class="org-builtin">:distinct</span>
                   <span class="org-builtin">:from</span> 'countries
                   <span class="org-builtin">:left-join</span> 'countries-topics
                   <span class="org-builtin">:using</span> ('country-id)
                   <span class="org-builtin">:where</span> (<span class="org-builtin">:is-null</span> 'countries-topics.country-id))
          'countries.country-id)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>